{
  "role": "FullStack Developer",
  "aboutMe": "Hi, I am Caíque, I was born at February 1, 1994. I have a degree in Computer Science at Universidade Federal de Goiás and I am currently a fullstack developer. My first contact with programming was around the age of 12 when I discovered that I could modify certain behaviors of a game I played by writing some instructions, it fascinated me and made me choose my course in college. I don't really like to limit myself to being a developer of X language/technology because I always like to be learning new things so if I have a problem and I need to develop a solution using a specific technology, even if I haven't had contact with that technology, for me it is not a problem: I will study it until I feel comfortable enough to use it in the solution. Currently JavaScript/TypeScript (and its entire stack) is my preferred choice.",
  "sections": {
    "titles": {
      "work_experience": "Work Experience",
      "education": "Education",
      "skill": "Skills"
    },
    "items": {
      "work_experience": [
        {
          "role": "FullStack Developer",
          "whereAndWhen": "Deal / aug 2020 - current",
          "description": "Working at ICTS, a company that provides several solutions for the risk management area. Responsible for the initial development of CI Analysis and participant in the RiskCheck development team. Working with the follow stack/technologies: PHP (Laravel 7/8), React, StyledComponents, MySQL, Postgres, Python, Robot Framework, Playwright, RabbitMQ e Jenkins."
        },
        {
          "role": "FullStack Developer",
          "whereAndWhen": "iRancho / dec 2019 - aug 2020",
          "description": "FullStack Developer working with stack fully based on JavaScript (NodeJS, Express, Sequelize and MySQL at backend; VueJS, ElementUI and Bootstrap at frontend) in iRancho, an beef cattle management application."
        },
        {
          "role": "FullStack Developer",
          "whereAndWhen": "Rede Nacional de Ensino e Pesquisa - RNP / jun 2019 - dec 2019",
          "description": "Working in FIBRE project (https://www.fibre.org.br/) with following technologies: Python, Django, RabbitMQ, RobotFramework and Bootstrap. Responsible for the initial development of FIBREChecker, a healthy checker for all FIBRE environment."
        },
        {
          "role": "Web application development",
          "whereAndWhen": "Freelance / dec 2017 - jan 2018",
          "description": "Development of a web application that works like a restaurant online menu where users could order their food and the restaurant received those orders, along with the delivery address and payment method. Developed with Laravel at backend and VueJS with Bulma at frontend."
        },
        {
          "role": "Mobile application development",
          "whereAndWhen": "Freelance / sept 2016",
          "description": "Development of a mobile application that calculates the amount of soybean seeds needed to sow a certain area. The application also shows a catalog of the types of seeds offered by the customer. Developed with Ionic Framework version 1.7.16."
        },
        {
          "role": "Jr FullStack Developer",
          "whereAndWhen": "Meta Tecnologia da Informação / sept 2014 - dec 2014",
          "description": "Developer of an ERP application for small and medium enterprises. Working with a Microsoft stack at backend: ASP.Net MVC Framework, Visual Studio, Azure and Team Foundation Service and at frontend was used ExtJS Framework."
        },
        {
          "role": "Internship in Software Testing",
          "whereAndWhen": "Meta Tecnologia da Informação / feb 2014 - aug 2014",
          "description": "Responsible for perform and automate tests in an ERP application for small and medium enterprises."
        }
      ],
      "education": [
        {
          "role": "Computer Science Bachelor",
          "whereAndWhen": "Universidade Federal de Goiás - UFG / 2012 - 2017",
          "description": "Programming Introduction's Tutor in 2013. Data Structure's Tutor between 2015 and 2016."
        }
      ],
      "skills": [
        "English C2 (Certificate: http://efset.org/cert/3FA9Pm).",
        "Knowledge in  C, Java, HTML, PHP, Python, Laravel, C#, JavaScript, jQuery, JSON, VueJS, Vuex, NodeJS, MySQL and ExpressJS.",
        "Basic Knowledge in Bootstrap, Django, Django REST Framework, Go, Bulma, CSS, Sass, ExtJS, ReactJS, ElementUI, MongoDB and Redux."
      ]
    }
  }
}
