{
  "role": "Desenvolvedor FullStack",
  "sections": {
    "titles": {
      "work_experience": "Experiência Profissional",
      "education": "Formação Acadêmica",
      "skill": "Habilidades"
    },
    "items": {
      "work_experience": [
        {
          "role": "Desenvolvedor FullStack",
          "whereAndWhen": "iRancho / dez 2019 - atualmente",
          "description": "Desenvolvedor FullStack trabalhando com toda stack no JavaScript (NodeJS, Express, Sequelize e MySQL no backend; VueJS, ElementUI e Bootstrap no frontend) no iRancho, uma aplicação para gestão de pecuária de corte."
        },
        {
          "role": "Desenvolvedor FullStack",
          "whereAndWhen": "Rede Nacional de Ensino e Pesquisa - RNP / jun 2019 - dez 2019",
          "description": "Trabalhando no projeto FIBRE (https://www.fibre.org.br/) com as seguintes tecnologias: Python, Django, RabbitMQ, RobotFramework e Bootstrap. Responsável pelo desenvolvimento inicial do FIBREChecker, um healthy checker para todo o ambiente do FIBRE."
        },
        {
          "role": "Desenvolvimento de Aplicação Web",
          "whereAndWhen": "Freelance / dez 2017 - jan 2018",
          "description": "Desenvolvimento de uma aplicação web que funcionava como um cardápio online para um restaurante. Os usuários poderiam montar seus pratos e/ ou escolher um prato feito. Na parte da administração eram listado todos os pedidos e endereço de entrega dos usuários. Foi desenvolvido com Laravel no backend e VueJS com Bulma no frontend."
        },
        {
          "role": "Desenvolvimento de Aplicação Mobile",
          "whereAndWhen": "Freelance / set 2016",
          "description": "Desenvolvimento de uma aplicação mobile que realizava o cálculo da quantidade de sementes de soja necessárias para semear uma certa área da sua fazenda. O aplicativo também funcionava como um catálogo dos tipos de sementes oferecidos pelo cliente. O desenvolvimento se deu com o Ionic Framework na sua versão 1.7.16."
        },
        {
          "role": "Desenvolvedor FullStack Júnior",
          "whereAndWhen": "Meta Tecnologia da Informação / set 2014 - dez 2014",
          "description": "Desenvolvedor de uma aplicação ERP para pequenas e médias empresas. Trabalhando com uma stack toda da Microsoft no backend: Framework ASP.Net MVC, Visual Studio, Azure e Team Foundation Service e no frontend foi utilizado o Framework ExtJS."
        },
        {
          "role": "Estágio em Teste de Software",
          "whereAndWhen": "Meta Tecnologia da Informação / fev 2014 - ago 2014",
          "description": "Responsável por testar e automatizar testes em uma aplicação ERP para pequenas e médias empresas."
        }
      ],
      "education": [
        {
          "role": "Bacharel em Ciência da Computação",
          "whereAndWhen": "Universidade Federal de Goiás - UFG / 2012 - 2017",
          "description": "Monitor de Introdução a Programação durante o ano de 2013. Monitor de Estrutura de Dados 1 durante os anos de 2015 e 2016."
        }
      ],
      "skills": [
        "Inglês nível C2 (Certificado: http://efset.org/cert/3FA9Pm).",
        "Conhecimentos em C, Java, HTML, PHP, Python, Laravel, C#, JavaScript, jQuery, JSON, VueJS, Vuex, NodeJS, MySQL e ExpressJS.",
        "Conhecimentos Básicos em Bootstrap, Django, Django REST Framework, Go, Bulma, CSS, Sass, ExtJS, ReactJS, ElementUI, MongoDB e Redux."
      ]
    }
  }
}
